In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
# import matplotlib.pyplot as plt

## 2、DataFrame

DataFrame是一个【表格型】的数据结构，可以看做是【由Series组成的字典】（多个series共用同一个索引）。DataFrame由按一定顺序排列的多列数据组成。设计初衷是将Series的使用场景从一维拓展到多维。DataFrame既有行索引，也有列索引。
- 行索引：index
- 列索引：columns
- 值：values（numpy的二维数组）

#### 1）DataFrame的创建

最常用的方法是传递一个字典或二维数组来创建。

In [23]:
# DataFrame([1,2,3,4])
nd = np.random.randint(0,150,size=(5,4))
nd
index=['张三','李四','王老五','zhaoliu','田七']
columns = ['python','java','c','math']
# 成绩表
# 参数 data是数据 index是行索引 columns是列索引
df = DataFrame(data=nd,index=index,columns=columns)
df

         python  java    c  math
张三          125    39   95    35
李四           67     2  117    85
王老五          14    21   77    45
zhaoliu      24   147   85   128
田七          140    89   26    29

In [9]:
DataFrame(data={
    'A':[1,2,3,4],
    'B':[1,2,3,4],
    'C':[1,2,3,4],
})

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

另外通过导入csv文件得到的也是DataFrame

In [8]:
heights = pd.read_csv('./data/president_heights.csv')
heights

    order                    name  height(cm)
0       1       George Washington         189
1       2              John Adams         170
2       3        Thomas Jefferson         189
3       4           James Madison         163
4       5            James Monroe         183
5       6       John Quincy Adams         171
6       7          Andrew Jackson         185
7       8        Martin Van Buren         168
8       9  William Henry Harrison         173
9      10              John Tyler         183
10     11           James K. Polk         173
11     12          Zachary Taylor         173
12     13        Millard Fillmore         175
13     14         Franklin Pierce         178
14     15          James Buchanan         183
15     16         Abraham Lincoln         193
16     17          Andrew Johnson         178
17     18        Ulysses S. Grant         173
18     19     Rutherford B. Hayes         174
19     20       James A. Garfield         183
20     21       Chester A. Arthur         183
21     23       Benjamin Harrison         168
22     25        William McKinley         170
23     26      Theodore Roosevelt         178
24     27     William Howard Taft         182
25     28          Woodrow Wilson         180
26     29       Warren G. Harding         183
27     30         Calvin Coolidge         178
28     31          Herbert Hoover         182
29     32   Franklin D. Roosevelt         188
30     33         Harry S. Truman         175
31     34    Dwight D. Eisenhower         179
32     35         John F. Kennedy         183
33     36       Lyndon B. Johnson         193
34     37           Richard Nixon         182
35     38             Gerald Ford         183
36     39            Jimmy Carter         177
37     40           Ronald Reagan         185
38     41       George H. W. Bush         188
39     42            Bill Clinton         188
40     43          George W. Bush         182
41     44            Barack Obama         185

DataFrame属性：values、columns、index、shape

In [14]:
heights.values  # 可以把DataFrame中的数据提取出来 提取出来的是多维数组
heights.columns  # 可以获取列名
heights.index  # 获取行索引
heights.shape

(42, 3)

============================================

练习4：

根据以下考试成绩表，创建一个DataFrame，命名为df：
```
    张三  李四
语文 150  0
数学 150  0
英语 150  0
理综 300  0
```

============================================

In [21]:
data = [[150,0],[150,0],[150,0],[300,0]]
data
index = ['语文','数学','英语','理综']
columns = ['张三','李四']
DataFrame(data=data,index=index,columns=columns)

     张三  李四
语文  150   0
数学  150   0
英语  150   0
理综  300   0

#### 2）DataFrame的索引

(1) 对列进行索引

    - 通过类似字典的方式
    - 通过属性的方式

 可以将DataFrame的列获取为一个Series。返回的Series拥有原DataFrame相同的索引，且name属性也已经设置好了，就是相应的列名。

In [24]:
df

         python  java    c  math
张三          125    39   95    35
李四           67     2  117    85
王老五          14    21   77    45
zhaoliu      24   147   85   128
田七          140    89   26    29

In [26]:
df['python']  # 获取列 可以通过中括号传入列名

pandas.core.series.Series

In [27]:
type(df['python'])

pandas.core.series.Series

In [28]:
df.python  # 获取到的是 Series

张三         125
李四          67
王老五         14
zhaoliu     24
田七         140
Name: python, dtype: int32

(2) 对行进行索引

    - 使用.loc[]加index来进行行索引
    - 使用.iloc[]加整数来进行行索引
    
 同样返回一个Series，index为原来的columns。

In [29]:
df

         python  java    c  math
张三          125    39   95    35
李四           67     2  117    85
王老五          14    21   77    45
zhaoliu      24   147   85   128
田七          140    89   26    29

In [31]:
# df['zhaoliu']
# df.zhaoliu
# 行相当于一共一共的样本 列相当于是对象的各种特征
# 列更重要

AttributeError: 'DataFrame' object has no attribute 'zhaoliu'

In [33]:
df.loc['zhaoliu']  # 获取到的也是Series
df.iloc[3]

python     24
java      147
c          85
math      128
Name: zhaoliu, dtype: int32

In [35]:
# 总结
# 对列进行索引 df['列名'] 或者 df.列名 获取到的是Series
# 对行进行索引 df.loc['行名'] 或者 df.iloc[索引号] 获取到的也是Series

(3) 对元素索引的方法
    - 使用列索引
    - 使用行索引(iloc[3,1]相当于两个参数;iloc[[3,3]] 里面的[3,3]看做一个参数)
    - 使用values属性（二维numpy数组）

In [39]:
df

         python  java    c  math
张三          125    39   95    35
李四           67     2  117    85
王老五          14    21   77    45
zhaoliu      24   147   85   128
田七          140    89   26    29

In [40]:
df.python

张三         125
李四          67
王老五         14
zhaoliu     24
田七         140
Name: python, dtype: int32

In [41]:
df['python']
df.python.loc['张三']
df.python.iloc[0]

125

In [42]:
df

         python  java    c  math
张三          125    39   95    35
李四           67     2  117    85
王老五          14    21   77    45
zhaoliu      24   147   85   128
田七          140    89   26    29

In [45]:
df.loc['张三'].loc['python']

125

In [46]:
df

         python  java    c  math
张三          125    39   95    35
李四           67     2  117    85
王老五          14    21   77    45
zhaoliu      24   147   85   128
田七          140    89   26    29

In [47]:
# DataFrame的loc和iloc中也可以使用 整数数组索引的形式
df.loc['张三','python']  # loc是 先行后列

125

In [48]:
df.iloc[0,0]

125

In [49]:
df

         python  java    c  math
张三          125    39   95    35
李四           67     2  117    85
王老五          14    21   77    45
zhaoliu      24   147   85   128
田七          140    89   26    29

In [53]:
df.iloc[0,0]
df.iloc[[0,1]]
df.iloc[[0,0]]

    python  java   c  math
张三     125    39  95    35
张三     125    39  95    35

In [ ]:
# 总结
# df.loc 里面用字符串索引 df.loc['行名','列名']
# df.iloc 里面用编号 df.iloc[行索引,列索引]

In [ ]:
# 韭菜 榴莲 臭豆腐 辣条

In [ ]:
# 王总 刘总 班长 学委 也是委员

In [55]:
data = np.random.randint(0,100,size=(5,4))
i = ['王总','刘总','班长','学委','也是委员']
c = ['韭菜','榴莲','臭豆腐','大蒜']
df = DataFrame(data=data,index=i,columns=c)
df

      韭菜  榴莲  臭豆腐  大蒜
王总    92   6   85   8
刘总    77  15    0  49
班长    96  63    1  37
学委     0  53   83  21
也是委员  46  91   54  10

【注意】
直接用中括号时：
- 索引表示的是列索引
- 切片表示的是行切片

In [56]:
df['韭菜']  # 索引是列索引

王总      92
刘总      77
班长      96
学委       0
也是委员    46
Name: 韭菜, dtype: int32

In [57]:
df['刘总':'学委']  # 切片是行切片

    韭菜  榴莲  臭豆腐  大蒜
刘总  77  15    0  49
班长  96  63    1  37
学委   0  53   83  21

In [59]:
df[0:3]  # 切片可以用 文字 也可以用数值

    韭菜  榴莲  臭豆腐  大蒜
王总  92   6   85   8
刘总  77  15    0  49
班长  96  63    1  37

如果非要对列进行切片可以使用loc或iloc的整数数组索引的形式

In [60]:
df

      韭菜  榴莲  臭豆腐  大蒜
王总    92   6   85   8
刘总    77  15    0  49
班长    96  63    1  37
学委     0  53   83  21
也是委员  46  91   54  10

In [61]:
df.loc['王总','韭菜']

92

In [62]:
df.loc['王总':'班长']

    韭菜  榴莲  臭豆腐  大蒜
王总  92   6   85   8
刘总  77  15    0  49
班长  96  63    1  37

In [63]:
df.loc[:,'韭菜':'臭豆腐']

      韭菜  榴莲  臭豆腐
王总    92   6   85
刘总    77  15    0
班长    96  63    1
学委     0  53   83
也是委员  46  91   54

In [64]:
df.iloc[:,0:3]

      韭菜  榴莲  臭豆腐
王总    92   6   85
刘总    77  15    0
班长    96  63    1
学委     0  53   83
也是委员  46  91   54

============================================

练习5：

使用多种方法对df进行索引和切片，并比较其中的区别

获取 王总 刘总 的 所有爱好

获取 所有人的 韭菜 臭豆腐 的喜爱程度


============================================

In [65]:
df

      韭菜  榴莲  臭豆腐  大蒜
王总    92   6   85   8
刘总    77  15    0  49
班长    96  63    1  37
学委     0  53   83  21
也是委员  46  91   54  10

In [69]:
df['王总':'刘总']
df.loc[['王总','刘总']]
df.loc[:,['韭菜','臭豆腐']]

      韭菜  臭豆腐
王总    92   85
刘总    77    0
班长    96    1
学委     0   83
也是委员  46   54

In [70]:
df.values

array([[92,  6, 85,  8],
       [77, 15,  0, 49],
       [96, 63,  1, 37],
       [ 0, 53, 83, 21],
       [46, 91, 54, 10]])

In [71]:
df.values[2,2]

1

#### 3）DataFrame的运算

(0) df和数值

In [72]:
df

      韭菜  榴莲  臭豆腐  大蒜
王总    92   6   85   8
刘总    77  15    0  49
班长    96  63    1  37
学委     0  53   83  21
也是委员  46  91   54  10

In [73]:
df + 2

      韭菜  榴莲  臭豆腐  大蒜
王总    94   8   87  10
刘总    79  17    2  51
班长    98  65    3  39
学委     2  55   85  23
也是委员  48  93   56  12

In [74]:
df * 2

       韭菜   榴莲  臭豆腐  大蒜
王总    184   12  170  16
刘总    154   30    0  98
班长    192  126    2  74
学委      0  106  166  42
也是委员   92  182  108  20

In [78]:
df.iloc[3] = df.iloc[3] + 200
df.iloc[3] += 200

In [79]:
df

       韭菜   榴莲  臭豆腐   大蒜
王总     92    6   85    8
刘总     77   15    0   49
班长     96   63    1   37
学委    400  453  483  421
也是委员   46   91   54   10

In [81]:
df.iloc[3,0] += 100

In [82]:
df

       韭菜   榴莲  臭豆腐   大蒜
王总     92    6   85    8
刘总     77   15    0   49
班长     96   63    1   37
学委    500  453  483  421
也是委员   46   91   54   10

（1） DataFrame之间的运算

同Series一样：

- 在运算中自动对齐不同索引的数据
- 如果索引不对应，则补NaN

创建DataFrame df1 不同人员的各科目成绩，月考一

In [84]:
df1 = DataFrame(np.random.randint(0,150,size=(5,4)),index=['jack','rose','tom','jerry','bob'],columns=['python','math','english','chinese'])
df1

       python  math  english  chinese
jack      146    30       74       79
rose       72   114      111       90
tom        28    42      109      139
jerry     134     7       85       99
bob        69   100       32       58

创建DataFrame df2 不同人员的各科目成绩，月考二  
有新学生转入

In [85]:
df2 = DataFrame(np.random.randint(0,150,size=(5,4)),index=['jack','rose','tom','jerry','bob'],columns=['python','math','english','chinese'])
df2

       python  math  english  chinese
jack      110   129       23      118
rose      106   145       87       71
tom       123   134       88       97
jerry     132    33       63       18
bob        38    40      106       76

In [86]:
df1+df2

       python  math  english  chinese
jack      256   159       97      197
rose      178   259      198      161
tom       151   176      197      236
jerry     266    40      148      117
bob       107   140      138      134

下面是Python 操作符与pandas操作函数的对应表：

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

（2） Series与DataFrame之间的运算

【重要】

- 使用Python操作符：以行为单位操作（参数必须是行），对所有行都有效。（类似于numpy中二维数组与一维数组的运算，但可能出现NaN）

- 使用pandas操作函数：

        axis=0：以列为单位操作（参数必须是列），对所有列都有效。
        axis=1：以行为单位操作（参数必须是行），对所有行都有效。

In [91]:
df1 = DataFrame(data=np.random.randint(0,150,size=(5,5)),index=list('abcde'),columns=list('12345'))
df1

     1   2    3    4    5
a   33  52   60    8   53
b  144  92  136  142    9
c  146   2  145   47  121
d   26  46   89  131   96
e   85   7  137   19   32

In [92]:
s1 = Series(data=np.random.randint(0,150,size=5),index=list('01234'))
s1

0    138
1    122
2     58
3    111
4     34
dtype: int32

In [89]:
s2 = Series(data=np.random.randint(0,150,size=5),index=list('abcde'))
s2

a     49
b     40
c    128
d     60
e    122
dtype: int32

In [93]:
df1 + s1  # df中的每一行都和Series去相加 是 对应项相加 如果没有对应项 用NaN补

    0      1      2      3      4   5
a NaN  155.0  110.0  171.0   42.0 NaN
b NaN  266.0  150.0  247.0  176.0 NaN
c NaN  268.0   60.0  256.0   81.0 NaN
d NaN  148.0  104.0  200.0  165.0 NaN
e NaN  207.0   65.0  248.0   53.0 NaN

In [94]:
df1 + s2

    1   2   3   4   5   a   b   c   d   e
a NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
b NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
c NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
d NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
e NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN

In [95]:
df1.add(s1)

    0      1      2      3      4   5
a NaN  155.0  110.0  171.0   42.0 NaN
b NaN  266.0  150.0  247.0  176.0 NaN
c NaN  268.0   60.0  256.0   81.0 NaN
d NaN  148.0  104.0  200.0  165.0 NaN
e NaN  207.0   65.0  248.0   53.0 NaN

In [98]:
# df1.add(s2,axis='columns')  # 默认是每一行相加 让列名对应
df1.add(s2,axis='index')

     1    2    3    4    5
a   82  101  109   57  102
b  184  132  176  182   49
c  274  130  273  175  249
d   86  106  149  191  156
e  207  129  259  141  154

============================================

练习6：

1. 假设ddd是期中考试成绩，ddd2是期末考试成绩，请自由创建ddd2，并将其与ddd相加，求期中期末平均值。

2. 假设张三期中考试数学被发现作弊，要记为0分，如何实现？

3. 李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？

4. 后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？

============================================

In [107]:
# 以后就别删这个了
df1 = DataFrame(data=np.random.randint(0,150,size=(3,3)),index=['张三','李四','王五'],columns=['语文','数学','英语'])
df1

     语文   数学   英语
张三  108   60   30
李四   65  137  131
王五   36   17   15

In [100]:
# 以后就别删这个了
df2 = DataFrame(data=np.random.randint(0,150,size=(3,3)),index=['张三','李四','王五'],columns=['语文','数学','英语'])
df2

     语文   数学   英语
张三   33  130  146
李四  144   68  142
王五  127   50   24

In [108]:
(df1+df2)/2

       语文     数学     英语
张三   70.5   95.0   88.0
李四  104.5  102.5  136.5
王五   81.5   33.5   19.5

In [111]:
df1.iloc[0,1] = 0

In [112]:
df1

     语文   数学   英语
张三  108    0   30
李四   65  137  131
王五   36   17   15

In [116]:
df1.loc['李四'] += 100

In [117]:
df1

     语文   数学   英语
张三  108    0   30
李四  165  237  231
王五   36   17   15

In [119]:
df1+=10
df1

     语文   数学   英语
张三  118   10   40
李四  175  247  241
王五   46   27   25

In [120]:
df1>100

       语文     数学     英语
张三   True  False  False
李四   True   True   True
王五  False  False  False